# Задача на пересечение множеств
a= [2, 4, 6, 8, 10, 12, 10, 8, 6, 4, 2]
b= [3, 6, 9, 12, 15, 18, 2, 8]
c = (set(a)).intersection(set(b))
if len(c) == 0:
    print('Повторяющихся чисел нет')
else:
    print(*sorted(c))



